# 데이터 준비하기: 다듬기, 변형, 병합

## 데이터 합치기
* 데이터베이스 스타일로 DataFrame 합치기
 * https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html
* 색인 머지하기
* 축 따라 이어붙이기
* 겹치는 데이터 합치기

In [3]:
import numpy as np
import pandas as pd
from pandas import DataFrame
from pandas import Series

In [4]:
df1 = DataFrame({'key': list('bbacaab'), 'data1': range(7)})

In [5]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [6]:
df2 = DataFrame({'key':list('abd'), 'data2':range(3)})

In [7]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [9]:
pd.merge(df1, df2, on='key')  # inner join

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [11]:
pd.merge(df1,df2, on='key', how='outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [12]:
pd.merge(df1, df2, on='key', how='left')

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

In [14]:
pd.merge(df1, df2, on='key', how='inner')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [15]:
# 축따라 이어 붙이기
arr = np.arange(12).reshape(3,4)
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [16]:
np.concatenate([arr,arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [ ]:
#겹치는 데이터 합치기

## 재형성과 피벗
* 계층적 색인으로 재형성하기
* 피버팅으로 데이터 나열 방식 바꾸기

In [ ]:
data = DataFrame

## 데이터 변형
* 중복 제거하기
* 함수나 매핑 이용해 데이터 변형하기
* 값 치환하기
* 축 색인 이름 바꾸기
* 개별화와 양자화
* 특이값 찾아내고 제외하기
* 치환과 임의 샘플링
* 표시자/데미 변수

## 문자열 다루기
* 문자열 객체 메서드
* 정규표현식
* pandas의 벡터화된 문자열 함수